Revit 2026 API

# TaskDialogId Property

---

The Id of the task dialog.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Id { get; set; }
```
```vb
Public Property Id As String
	Get
	Set
```
```cpp
public:
property String^ Id {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Id : string with get, set
```

#### Property Value

String

Id is used as follows:

  * TaskDialogShowingEventArgs.DialogId for DialogBoxShowing events
  * As part of the Contextual Help Topic when invoking Revit contextual help

#### Reference

TaskDialog Class

Autodesk.Revit.UI Namespace